{
  "version": "2.2.0",
  "summary": {
    "title": "SISTEMA I'm HUNGRY",
    "owner": "Eduardo chacon",
    "description": "El sistema de software I’m Hungry, es un producto de software destinado a los estudiantes e\nintegrantes que conforman el proceso de compra y venta de alimentos en la Facultad de\nEstadística e Informática perteneciente a la Universidad Veracruzana. Es decir, el sistema de\nsoftware es destinado a los estudiantes vendedores que desean ofrecer sus productos para la\nventa dentro de la FEI, es destinado a su vez a los estudiantes compradores que buscan productos\npara el consumo dentro de la FEI y personal perteneciente a la facultad que desee fungir alguno de\nestos roles.",
    "id": 0
  },
  "detail": {
    "contributors": [
      {
        "name": "ctr305"
      }
    ],
    "diagrams": [
      {
        "id": 0,
        "title": "Diagrama de flujo de datos para el sitio web de I´M HUNGRY",
        "diagramType": "STRIDE",
        "placeholder": "Descripción de nuevo diagrama STRIDE",
        "thumbnail": "./public/content/images/thumbnail.stride.jpg",
        "version": "2.2.0",
        "cells": [
          {
            "position": {
              "x": 460,
              "y": 160
            },
            "size": {
              "width": 150,
              "height": 130
            },
            "attrs": {
              "text": {
                "text": "Sitio web\n I´M HUNGRY"
              },
              "body": {
                "stroke": "red",
                "strokeWidth": 2.5,
                "strokeDasharray": null
              }
            },
            "visible": true,
            "shape": "process",
            "id": "f534df77-519b-4e49-9ec6-67d0fd9c2beb",
            "zIndex": 1,
            "data": {
              "type": "tm.Process",
              "name": "Sitio web\n I´M HUNGRY",
              "description": "",
              "outOfScope": false,
              "reasonOutOfScope": "",
              "hasOpenThreats": true,
              "handlesCardPayment": false,
              "handlesGoodsOrServices": false,
              "isWebApplication": false,
              "privilegeLevel": "",
              "threats": [
                {
                  "id": "558233dc-db1b-4bfb-a399-1912a8da79af",
                  "title": "Denegación de servicio",
                  "status": "Open",
                  "severity": "High",
                  "type": "Denial of service / Denegación de servicio",
                  "description": "amenaza busca interrumpir o denegar el acceso legítimo a usuarios válidos, como hacer que un servidor web no esté disponible o sea inutilizable temporalmente, impidiendo así que los usuarios accedan a los servicios que ofrece el sistema. \nUn atacante podría modificar maliciosamente datos persistentes o alterar datos en tránsito, lo que le permitiría manipular información crítica, como la modificación de registros en una base de datos o la interceptación y modificación de datos durante su transmisión a través de una red abierta.",
                  "mitigation": "La mitigación de esta amenaza implica implementar medidas de seguridad a nivel de red, como firewalls y sistemas de prevención de intrusiones (IPS), así como servicios de mitigación de ataques DDoS para filtrar y bloquear el tráfico malicioso y mantener la disponibilidad del servicio",
                  "modelType": "STRIDE",
                  "new": false,
                  "number": 1,
                  "score": ""
                },
                {
                  "id": "7ebd534a-53f0-4759-8aaf-1c48c9045f21",
                  "title": "MANIPULACIÓN",
                  "status": "Open",
                  "severity": "Medium",
                  "type": "Tampering / Manipulación",
                  "description": "amenaza consiste en modificar de manera maliciosa datos persistentes, como registros en una base de datos, o alterar datos en tránsito entre dos computadoras a través de una red abierta, como Internet, con el fin de manipular la información de manera indebida o perjudicial.\nUn atacante podría modificar maliciosamente datos persistentes o alterar datos de la pagina , lo que le permitiría manipular información crítica",
                  "mitigation": "mitigar esta amenaza, es fundamental implementar controles de integridad de datos, como firmas digitales o funciones hash, para detectar y prevenir modificaciones no autorizadas en los datos, además de utilizar conexiones seguras y cifrado de extremo a extremo para proteger los datos en tránsito.",
                  "modelType": "STRIDE",
                  "new": false,
                  "number": 2,
                  "score": ""
                }
              ]
            }
          },
          {
            "position": {
              "x": 310,
              "y": 60
            },
            "size": {
              "width": 112.5,
              "height": 60
            },
            "attrs": {
              "text": {
                "text": "Estudiante"
              },
              "body": {
                "stroke": "#333333",
                "strokeWidth": 1.5,
                "strokeDasharray": null
              }
            },
            "visible": true,
            "shape": "actor",
            "id": "9550776e-2813-4bcd-a735-65200a3c72af",
            "zIndex": 2,
            "data": {
              "type": "tm.Actor",
              "name": "Estudiante",
              "description": "",
              "outOfScope": false,
              "reasonOutOfScope": "",
              "hasOpenThreats": false,
              "providesAuthentication": false,
              "threats": [
                {
                  "id": "dca69567-b8fd-4313-aa4c-3451ff18b02f",
                  "title": "suplantación de identidad",
                  "status": "Mitigated",
                  "severity": "Medium",
                  "type": "Spoofing / Spoofing",
                  "description": "Esta amenaza implica el uso fraudulento de las credenciales de otro usuario, como su nombre de usuario y contraseña, con el objetivo de acceder a recursos o servicios protegidos. Un atacante podría acceder y utilizar las credenciales de otro usuario, como el nombre de usuario y la contraseña",
                  "mitigation": "Esta amenaza puede mitigarse mediante la implementación de medidas de autenticación robustas, como la autenticación multifactor (por ejemplo, combinando contraseña con un código enviado al teléfono móvil del usuario) y la detección de comportamiento anómalo para identificar intentos de acceso no autorizados.",
                  "modelType": "STRIDE",
                  "new": false,
                  "number": 3,
                  "score": ""
                }
              ]
            }
          }
        ]
      }
    ],
    "diagramTop": 1,
    "reviewer": "eduardo",
    "threatTop": 3
  }
}